---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ExternalDataTypeServerFailureResolutionExecutingEventArgs
source: html/9dcc2120-3be1-819b-6c37-6761e4d02735.htm
---
# ExternalDataTypeServerFailureResolutionExecutingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.